In [4]:
import pandas as pd

## Pandas Basic Operations

### How to create a dataframe?

In [3]:
#Method 1
df1 = pd.DataFrame({
  'Product ID': [1, 2, 3, 4],
  'Product Name': ['shirt','top','shoes','skirt'],
  'Color': ["blue","green","red","black"]
})

print(df1)

   Product ID Product Name  Color
0           1        shirt   blue
1           2          top  green
2           3        shoes    red
3           4        skirt  black

In [4]:
#Method 2
df2 = pd.DataFrame([
  [1, 'San Diego', 100],
  [2, 'Los Angeles', 120],
  [3, 'San Francisco', 90],
  [4, 'Sacramento', 115]
],
  columns=[
    'Store ID', 'Location', 'Number of Employees'
  ])

print(df2)

   Store ID       Location  Number of Employees
0         1      San Diego                  100
1         2    Los Angeles                  120
2         3  San Francisco                   90
3         4     Sacramento                  115

### How to select column(s)?

In [10]:
location = df2['Location']
print(location)
print(type(location))

0        San Diego
1      Los Angeles
2    San Francisco
3       Sacramento
Name: Location, dtype: object
<class 'pandas.core.series.Series'>

In [11]:
location1 = df2[['Location']]
print(location1)
print(type(location1))

        Location
0      San Diego
1    Los Angeles
2  San Francisco
3     Sacramento
<class 'pandas.core.frame.DataFrame'>

In [12]:
mutliplecolumns = df2[['Location','Number of Employees']]
print(mutliplecolumns)
print(type(mutliplecolumns))

        Location  Number of Employees
0      San Diego                  100
1    Los Angeles                  120
2  San Francisco                   90
3     Sacramento                  115
<class 'pandas.core.frame.DataFrame'>

### How to select row(s)?

In [16]:
#iloc is Integer-location based indexing for selection by position.
df1.iloc[2] #https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.iloc.html

Product ID          3
Product Name    shoes
Color             red
Name: 2, dtype: object

In [17]:
df1.iloc[2:3]

   Product ID Product Name Color
2           3        shoes   red

In [14]:
df2.iloc[2:]

   Store ID       Location  Number of Employees
2         3  San Francisco                   90
3         4     Sacramento                  115

### How to select rows with logic?

In [20]:
Sacramento = df2[df2.Location == 'Sacramento']
print(Sacramento)

   Store ID    Location  Number of Employees
3         4  Sacramento                  115

In [23]:
Sacramento_SF = df2[(df2.Location == 'Sacramento') | (df2.Location == 'San Francisco')]
print(Sacramento_SF)

   Store ID       Location  Number of Employees
2         3  San Francisco                   90
3         4     Sacramento                  115

In [25]:
Sacramento_SF2 = df2[df2.Location.isin(['Sacramento','San Francisco'])]
print(Sacramento_SF2)

   Store ID       Location  Number of Employees
2         3  San Francisco                   90
3         4     Sacramento                  115

### How to reset index in a dataframe?

In [38]:
df3 = df2.loc[[1, 3]]
df3

   Store ID     Location  Number of Employees
1         2  Los Angeles                  120
3         4   Sacramento                  115

In [39]:
df3 = df3.reset_index()
print(df3)

   index  Store ID     Location  Number of Employees
0      1         2  Los Angeles                  120
1      3         4   Sacramento                  115

In [42]:
df4 = df2.loc[[1, 3]]
df4.reset_index(inplace = True, drop = True)
print(df4)

   Store ID     Location  Number of Employees
0         2  Los Angeles                  120
1         4   Sacramento                  115

### How to add columns in dataframe?

In [43]:
df1['isAvailable'] = 'Yes'
print(df1)

   Product ID Product Name  Color isAvailable
0           1        shirt   blue         Yes
1           2          top  green         Yes
2           3        shoes    red         Yes
3           4        skirt  black         Yes

In [63]:
df2['Visited'] = ['Yes','Yes','Yes','No']
print(df2)

   Store ID       Location  Number of Employees Visited
0         1      San Diego                  100     Yes
1         2    Los Angeles                  120     Yes
2         3  San Francisco                   90     Yes
3         4     Sacramento                  115      No

In [45]:
df = pd.DataFrame([
  [1, 'bottle', 0.5, 0.75],
  [2, 'cup', 0.10, 0.25],
  [3, 'plate', 3.00, 5.50],
  [4, 'glass', 2.50, 3.00]
],
  columns=['Product ID', 'Product Name', 'Cost', 'Price']
)
df['Revenue'] = df['Price'] - df['Cost']
print(df)

   Product ID Product Name  Cost  Price  Revenue
0           1       bottle   0.5   0.75     0.25
1           2          cup   0.1   0.25     0.15
2           3        plate   3.0   5.50     2.50
3           4        glass   2.5   3.00     0.50

### How to apply lambda function to a column?

In [46]:
capitalize_first_letter = lambda x: x.capitalize()
df['Product Name'] = df['Product Name'].apply(capitalize_first_letter)
print(df)

   Product ID Product Name  Cost  Price  Revenue
0           1       Bottle   0.5   0.75     0.25
1           2          Cup   0.1   0.25     0.15
2           3        Plate   3.0   5.50     2.50
3           4        Glass   2.5   3.00     0.50

### How to apply lambda function to a row?

In [54]:
revenue_using_lambda = lambda row: row.Price - row.Cost
df['Revenue2']=df.apply(revenue_using_lambda,axis=1)
print(df)

   Product ID Product Name  Cost  Price  Revenue  Revenue2
0           1       Bottle   0.5   0.75     0.25      0.25
1           2          Cup   0.1   0.25     0.15      0.15
2           3        Plate   3.0   5.50     2.50      2.50
3           4        Glass   2.5   3.00     0.50      0.50

### How to drop column(s) in a dataframe?

In [55]:
df_drop = df.drop('Revenue2',axis=1)
print(df_drop)

   Product ID Product Name  Cost  Price  Revenue
0           1       Bottle   0.5   0.75     0.25
1           2          Cup   0.1   0.25     0.15
2           3        Plate   3.0   5.50     2.50
3           4        Glass   2.5   3.00     0.50

In [58]:
df_drop2 = df.drop(['Price','Cost'],axis=1)
print(df_drop2)

   Product ID Product Name  Revenue  Revenue2
0           1       Bottle     0.25      0.25
1           2          Cup     0.15      0.15
2           3        Plate     2.50      2.50
3           4        Glass     0.50      0.50

### How to drop index in a dataframe?

In [56]:
df_drop_index = df.drop(0)
print(df_drop_index)

   Product ID Product Name  Cost  Price  Revenue  Revenue2
1           2          Cup   0.1   0.25     0.15      0.15
2           3        Plate   3.0   5.50     2.50      2.50
3           4        Glass   2.5   3.00     0.50      0.50

In [57]:
df_drop_index2 = df.drop([1,3])
print(df_drop_index2)

   Product ID Product Name  Cost  Price  Revenue  Revenue2
0           1       Bottle   0.5   0.75     0.25      0.25
2           3        Plate   3.0   5.50     2.50      2.50

### How to rename columns?

In [59]:
#Method 1
df.columns = ['Product ID','Product Description','Cost','Price','Revenue','Revenue2']
print(df)

   Product ID Product Description  Cost  Price  Revenue  Revenue2
0           1              Bottle   0.5   0.75     0.25      0.25
1           2                 Cup   0.1   0.25     0.15      0.15
2           3               Plate   3.0   5.50     2.50      2.50
3           4               Glass   2.5   3.00     0.50      0.50

In [61]:
#Method 2
df.rename(columns = {'Revenue2': 'Rev'}, inplace = True)
print(df)

   Product ID Product Description  Cost  Price  Revenue   Rev
0           1              Bottle   0.5   0.75     0.25  0.25
1           2                 Cup   0.1   0.25     0.15  0.15
2           3               Plate   3.0   5.50     2.50  2.50
3           4               Glass   2.5   3.00     0.50  0.50

### How to change the order of the columns?

In [62]:
column_names = ['Product ID','Product Description','Price','Cost','Revenue','Rev']
df_orderchanged = df.reindex(columns=column_names)
print(df_orderchanged)

   Product ID Product Description  Price  Cost  Revenue   Rev
0           1              Bottle   0.75   0.5     0.25  0.25
1           2                 Cup   0.25   0.1     0.15  0.15
2           3               Plate   5.50   3.0     2.50  2.50
3           4               Glass   3.00   2.5     0.50  0.50

## Some other pandas operations

### How to read a csv file?

In [14]:
#Read a csv
orders = pd.read_csv('orders.csv')
orders.head(5)

,id,first_name,last_name,email,item,material,item_color,price
0,1,John,Smith,JohnSmith@abc.com,dress,cotton,black,385
1,2,Nichi,Baskin,NichiBaskin@abc.com,skirt,fabric,brown,388
2,3,Abby,Robins,AbbyRobins@abc.com,bag,leather,blue,346
3,4,Rohit,Sweeney,RohitSweeney@abc.com,sandles,leather,red,344
4,5,Elena,Matt,ElenaMatt@abc.com,stockings,net,yellow,289

### How to get more information regarding the structure of the dataframe?

In [7]:
orders.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 8 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   id          10 non-null     int64
 1   first_name  10 non-null     object
 2   last_name   10 non-null     object
 3   email       10 non-null     object
 4   item        10 non-null     object
 5   material    10 non-null     object
 6   item_color  10 non-null     object
 7   price       10 non-null     int64
dtypes: int64(2), object(6)
memory usage: 768.0+ bytes

In [21]:
orders.describe()

             id       price
count  10.00000   10.000000
mean    5.50000  336.000000
std     3.02765   67.164806
min     1.00000  241.000000
25%     3.25000  271.750000
50%     5.50000  345.000000
75%     7.75000  387.250000
max    10.00000  440.000000

### How to change the datatype of a column?

In [19]:
#change the data type of the column
orders['material'] = orders.material.astype('category')

#check the data type of the column
orders.material.dtypes

CategoricalDtype(categories=['cotton', 'fabric', 'glass', 'leather', 'net', 'wood'], ordered=False)

In [20]:
#to see unique values of categories (factors or levels)
orders.material.cat.categories

Index(['cotton', 'fabric', 'glass', 'leather', 'net', 'wood'], dtype='object')

### How to subset a dataframe?

In [6]:
#Subsetting dataframe
subset1 = orders[:][['first_name','last_name','email']]
subset1.head()

  first_name last_name                 email
0       John     Smith     JohnSmith@abc.com
1      Nichi    Baskin   NichiBaskin@abc.com
2       Abby    Robins    AbbyRobins@abc.com
3      Rohit   Sweeney  RohitSweeney@abc.com
4      Elena      Matt     ElenaMatt@abc.com

### How to choose columns based on conditions?

In [67]:
#Most expensive order
most_expensive = orders.price.max()
print(most_expensive)

440

In [71]:
orders[orders.price==orders.price.max()]

,id,first_name,last_name,email,item,material,item_color,price
9,10,Carol,Mclovin,CarolMclovin@abc.com,anklet,glass,brown,440

In [72]:
#Least expensive order
orders[orders.price==orders.price.min()]

,id,first_name,last_name,email,item,material,item_color,price
7,8,Justin,Hardinge,JustinHardinge@abc.com,pumps,wood,white,241

In [74]:
#Choosing a column based on a condition
orders['first_name'][orders.price==orders.price.min()]

7    Justin
Name: first_name, dtype: object

In [77]:
#Finding the number of unique items
num_unique_items = orders.item.nunique()
print(num_unique_items)
num_unique_materials = orders.material.nunique()
print(num_unique_materials)

10
6

### How to add columns?

In [79]:
#Adding column gender
orders['Gender'] = ['M','F','M','NB','F','NB','M','F','NB','F']
print(orders)

   id first_name last_name                   email       item material  \
0   1       John     Smith       JohnSmith@abc.com      dress   cotton
1   2      Nichi    Baskin     NichiBaskin@abc.com      skirt   fabric
2   3       Abby    Robins      AbbyRobins@abc.com        bag  leather
3   4      Rohit   Sweeney    RohitSweeney@abc.com    sandles  leather
4   5      Elena      Matt       ElenaMatt@abc.com  stockings      net
5   6      Jammy     Singh      JammySingh@abc.com   hairband   fabric
6   7       Omar      Khan        OmarKhan@abc.com    bangles    glass
7   8     Justin  Hardinge  JustinHardinge@abc.com      pumps     wood
8   9      Steph      King       StephKing@abc.com   slippers  leather
9  10      Carol   Mclovin    CarolMclovin@abc.com     anklet    glass

  item_color  price Gender
0      black    385      M
1      brown    388      F
2       blue    346      M
3        red    344     NB
4     yellow    289      F
5       pink    266     NB
6      black    395      M
7      white    241      F
8        red    266     NB
9      brown    440      F

In [82]:
#Column transformation using lambda function
orders['Gender_full'] = orders.Gender.apply(lambda x: 'Female' if x == 'F' else ('Male' if x=='M' else 'Non-Binary'))
print(orders)

   id first_name last_name                   email       item material  \
0   1       John     Smith       JohnSmith@abc.com      dress   cotton
1   2      Nichi    Baskin     NichiBaskin@abc.com      skirt   fabric
2   3       Abby    Robins      AbbyRobins@abc.com        bag  leather
3   4      Rohit   Sweeney    RohitSweeney@abc.com    sandles  leather
4   5      Elena      Matt       ElenaMatt@abc.com  stockings      net
5   6      Jammy     Singh      JammySingh@abc.com   hairband   fabric
6   7       Omar      Khan        OmarKhan@abc.com    bangles    glass
7   8     Justin  Hardinge  JustinHardinge@abc.com      pumps     wood
8   9      Steph      King       StephKing@abc.com   slippers  leather
9  10      Carol   Mclovin    CarolMclovin@abc.com     anklet    glass

  item_color  price Gender Gender_full
0      black    385      M        Male
1      brown    388      F      Female
2       blue    346      M        Male
3        red    344     NB  Non-Binary
4     yellow    289      F      Female
5       pink    266     NB  Non-Binary
6      black    395      M        Male
7      white    241      F      Female
8        red    266     NB  Non-Binary
9      brown    440      F      Female

In [86]:
#Row transformation using lambda function
orders['Title'] = orders.apply(lambda row: 'Ms. ' + row['last_name']
                                    if row['Gender'] == 'F' else
                                    ('Mr. ' + row['last_name'] if row['Gender'] == 'M' else 'Mx. '+ row['last_name']),
                                    axis=1)
print(orders)

   id first_name last_name                   email       item material  \
0   1       John     Smith       JohnSmith@abc.com      dress   cotton
1   2      Nichi    Baskin     NichiBaskin@abc.com      skirt   fabric
2   3       Abby    Robins      AbbyRobins@abc.com        bag  leather
3   4      Rohit   Sweeney    RohitSweeney@abc.com    sandles  leather
4   5      Elena      Matt       ElenaMatt@abc.com  stockings      net
5   6      Jammy     Singh      JammySingh@abc.com   hairband   fabric
6   7       Omar      Khan        OmarKhan@abc.com    bangles    glass
7   8     Justin  Hardinge  JustinHardinge@abc.com      pumps     wood
8   9      Steph      King       StephKing@abc.com   slippers  leather
9  10      Carol   Mclovin    CarolMclovin@abc.com     anklet    glass

  item_color  price Gender Gender_full         Title
0      black    385      M        Male     Mr. Smith
1      brown    388      F      Female    Ms. Baskin
2       blue    346      M        Male    Mr. Robins
3        red    344     NB  Non-Binary   Mx. Sweeney
4     yellow    289      F      Female      Ms. Matt
5       pink    266     NB  Non-Binary     Mx. Singh
6      black    395      M        Male      Mr. Khan
7      white    241      F      Female  Ms. Hardinge
8        red    266     NB  Non-Binary      Mx. King
9      brown    440      F      Female   Ms. Mclovin

### How to perform aggregations?

In [87]:
#Performing aggregations
totprice_material = orders.groupby('material').price.sum()
print(totprice_material)
print(type(totprice_material))

material
cotton     385
fabric     654
glass      835
leather    956
net        289
wood       241
Name: price, dtype: int64
<class 'pandas.core.series.Series'>

In [89]:
maxprice_material = orders.groupby('material').price.max().reset_index()
print(maxprice_material)
print(type(maxprice_material))

  material  price
0   cotton    385
1   fabric    388
2    glass    440
3  leather    346
4      net    289
5     wood    241
<class 'pandas.core.frame.DataFrame'>

In [90]:
item_counts = orders.groupby(['item','material']).id.count().reset_index()
print(item_counts)

        item material  id
0     anklet    glass   1
1        bag  leather   1
2    bangles    glass   1
3      dress   cotton   1
4   hairband   fabric   1
5      pumps     wood   1
6    sandles  leather   1
7      skirt   fabric   1
8   slippers  leather   1
9  stockings      net   1

In [91]:
color_counts = orders.groupby(['item_color','material']).id.count().reset_index()
print(color_counts)

  item_color material  id
0      black   cotton   1
1      black    glass   1
2       blue  leather   1
3      brown   fabric   1
4      brown    glass   1
5       pink   fabric   1
6        red  leather   2
7      white     wood   1
8     yellow      net   1